{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_11",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                null
                            ],
                            "batch_input_shape": [
                                null,
                                null
                            ],
                            "dtype": "int64",
                            "sparse": false,
                            "name": "input_layer_6"
                        },
                        "name": "input_layer_6",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "positional_embedding>PositionalEmbedding",
                        "config": {
                            "name": "positional_embedding_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "output_dim": 256,
                            "sequence_length": 3,
                            "input_dim": 547
                        },
                        "name": "positional_embedding_1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null
                                            ],
                                            "dtype": "int64",
                                            "keras_history": [
                                                "input_layer_6",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "transformer_decoder>TransformerDecoder",
                        "config": {
                            "name": "transformer_decoder_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "embed_dim": 256,
                            "num_heads": 2,
                            "dense_dim": 256
                        },
                        "name": "transformer_decoder_5",
                        "inbound_nodes": [
                            {
                                "args": [],
                                "kwargs": {
                                    "inputs": {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "positional_embedding_1",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "transformer_decoder>TransformerDecoder",
                        "config": {
                            "name": "transformer_decoder_6",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "embed_dim": 256,
                            "num_heads": 2,
                            "dense_dim": 256
                        },
                        "name": "transformer_decoder_6",
                        "inbound_nodes": [
                            {
                                "args": [],
                                "kwargs": {
                                    "inputs": {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "transformer_decoder_5",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "transformer_decoder>TransformerDecoder",
                        "config": {
                            "name": "transformer_decoder_7",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "embed_dim": 256,
                            "num_heads": 2,
                            "dense_dim": 256
                        },
                        "name": "transformer_decoder_7",
                        "inbound_nodes": [
                            {
                                "args": [],
                                "kwargs": {
                                    "inputs": {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "transformer_decoder_6",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "transformer_decoder>TransformerDecoder",
                        "config": {
                            "name": "transformer_decoder_8",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "embed_dim": 256,
                            "num_heads": 2,
                            "dense_dim": 256
                        },
                        "name": "transformer_decoder_8",
                        "inbound_nodes": [
                            {
                                "args": [],
                                "kwargs": {
                                    "inputs": {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "transformer_decoder_7",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "transformer_decoder>TransformerDecoder",
                        "config": {
                            "name": "transformer_decoder_9",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "embed_dim": 256,
                            "num_heads": 2,
                            "dense_dim": 256
                        },
                        "name": "transformer_decoder_9",
                        "inbound_nodes": [
                            {
                                "args": [],
                                "kwargs": {
                                    "inputs": {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "transformer_decoder_8",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_21",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 547,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_21",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                256
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "transformer_decoder_9",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_layer_6",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_21",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "sparse_categorical_crossentropy",
            "loss_weights": null,
            "metrics": null,
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": true,
            "optimizer_config": {
                "class_name": "RMSprop",
                "config": {
                    "name": "rmsprop",
                    "learning_rate": 0.0010000000474974513,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "rho": 0.9,
                    "momentum": 0.0,
                    "epsilon": 1e-07,
                    "centered": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of4.bin",
                "group1-shard2of4.bin",
                "group1-shard3of4.bin",
                "group1-shard4of4.bin"
            ],
            "weights": [
                {
                    "name": "dense_21/kernel",
                    "shape": [
                        256,
                        547
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_21/bias",
                    "shape": [
                        547
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "positional_embedding_1/embedding_2/embeddings",
                    "shape": [
                        547,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "positional_embedding_1/embedding_3/embeddings",
                    "shape": [
                        3,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/query/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/query/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/key/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/key/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/value/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/value/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/attention_output/kernel",
                    "shape": [
                        2,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/multi_head_attention_5/attention_output/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/sequential_5/dense_11/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/sequential_5/dense_11/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/sequential_5/dense_12/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/sequential_5/dense_12/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/layer_normalization_10/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/layer_normalization_10/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/layer_normalization_11/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_5/layer_normalization_11/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/query/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/query/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/key/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/key/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/value/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/value/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/attention_output/kernel",
                    "shape": [
                        2,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/multi_head_attention_6/attention_output/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/sequential_6/dense_13/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/sequential_6/dense_13/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/sequential_6/dense_14/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/sequential_6/dense_14/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/layer_normalization_12/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/layer_normalization_12/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/layer_normalization_13/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_6/layer_normalization_13/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/query/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/query/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/key/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/key/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/value/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/value/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/attention_output/kernel",
                    "shape": [
                        2,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/multi_head_attention_7/attention_output/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/sequential_7/dense_15/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/sequential_7/dense_15/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/sequential_7/dense_16/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/sequential_7/dense_16/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/layer_normalization_14/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/layer_normalization_14/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/layer_normalization_15/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_7/layer_normalization_15/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/query/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/query/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/key/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/key/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/value/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/value/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/attention_output/kernel",
                    "shape": [
                        2,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/multi_head_attention_8/attention_output/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/sequential_8/dense_17/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/sequential_8/dense_17/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/sequential_8/dense_18/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/sequential_8/dense_18/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/layer_normalization_16/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/layer_normalization_16/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/layer_normalization_17/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_8/layer_normalization_17/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/query/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/query/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/key/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/key/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/value/kernel",
                    "shape": [
                        256,
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/value/bias",
                    "shape": [
                        2,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/attention_output/kernel",
                    "shape": [
                        2,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/multi_head_attention_9/attention_output/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/sequential_9/dense_19/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/sequential_9/dense_19/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/sequential_9/dense_20/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/sequential_9/dense_20/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/layer_normalization_18/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/layer_normalization_18/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/layer_normalization_19/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "transformer_decoder_9/layer_normalization_19/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}